Revit 2027 API
PanelScheduleTemplate.IsBranchPanelSchedule Property
 Checks to see if this object is branch panel schedule template element.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsBranchPanelSchedule { get; }
Public ReadOnly Property IsBranchPanelSchedule As Boolean
	Get
public:
property bool IsBranchPanelSchedule {
	bool get ();
}
member IsBranchPanelSchedule : bool with get
Property Value
Boolean
See Also
Reference
PanelScheduleTemplate Class
Autodesk.Revit.DB.Electrical Namespace